src/Catalogs/УчетныеЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияWindows</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБлокировкиСеансов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУчетнойЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУчетныхЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыУчетныхЗаписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыУчетныхЗаписей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УчетнаяЗаписьИБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетнаяЗаписьСервера1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетнаяЗаписьSQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетнаяЗаписьХранилищаКонфигураций</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/УчетныеЗаписи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
//
//
Процедура УправлениеЭлементамиФормы()	
	ЭтоУчетнаяЗаписьИБ = (Объект.ТипУчетнойЗаписи = ПредопределенноеЗначение("Перечисление.ТипыУчетныхЗаписей.УчетнаяЗаписьИБ"));
	ЭтоУчетнаяЗаписьХранилищаКонфигураций = (Объект.ТипУчетнойЗаписи = ПредопределенноеЗначение("Перечисление.ТипыУчетныхЗаписей.УчетнаяЗаписьХранилищаКонфигураций"));
	
	Элементы.КодБлокировкиСеансов.Видимость = ЭтоУчетнаяЗаписьИБ;
	Элементы.КодБлокировкиСеансов.Доступность = ЭтоУчетнаяЗаписьИБ;
	
	Если ЗначениеЗаполнено(Объект.КодБлокировкиСеансов) И НЕ ЭтоУчетнаяЗаписьИБ Тогда
		Объект.КодБлокировкиСеансов = "";
	КонецЕсли;
	
	Если Объект.АвторизацияWindows И ЭтоУчетнаяЗаписьХранилищаКонфигураций Тогда
		Объект.АвторизацияWindows = Ложь;
	КонецЕсли;
	Элементы.АвторизацияWindows.Видимость = НЕ ЭтоУчетнаяЗаписьХранилищаКонфигураций;
	Элементы.АвторизацияWindows.Доступность = НЕ ЭтоУчетнаяЗаписьХранилищаКонфигураций;
	
	
	Элементы.Пароль.Видимость = НЕ Объект.АвторизацияWindows;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ТипУчетнойЗаписиПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПриОткрытии(Отказ)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
//
//
Процедура АвторизацияWindowsПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры
